#!/usr/bin/python
from collections import OrderedDict
from bidict import bidict
import readline #解决：输入不能backspace，还可以记录之前输入

#甲,乙,丙,丁,戊,己,庚,辛,壬,癸
#子,丑,寅,卯,辰,巳,午,未,申,酉,戌,亥

print ("Hello, Python!")
tiangan=('甲','乙','丙','丁','戊','己','庚','辛','壬','癸') #tuple
dizhi=('子','丑','寅','卯','辰','巳','午','未','申','酉','戌','亥')
tiangan_group=('甲乙','丙丁','戊己','庚辛','壬癸')
tiangan_100=(
'甲甲','甲乙','甲丙','甲丁','甲戊','甲己','甲庚','甲辛','甲壬','甲癸',
'乙甲','乙乙','乙丙','乙丁','乙戊','乙己','乙庚','乙辛','乙壬','乙癸',
'丙甲','丙乙','丙丙','丙丁','丙戊','丙己','丙庚','丙辛','丙壬','丙癸',
'丁甲','丁乙','丁丙','丁丁','丁戊','丁己','丁庚','丁辛','丁壬','丁癸',
'戊甲','戊乙','戊丙','戊丁','戊戊','戊己','戊庚','戊辛','戊壬','戊癸',
'己甲','己乙','己丙','己丁','己戊','己己','己庚','己辛','己壬','己癸',
'庚甲','庚乙','庚丙','庚丁','庚戊','庚己','庚庚','庚辛','庚壬','庚癸',
'辛甲','辛乙','辛丙','辛丁','辛戊','辛己','辛庚','辛辛','辛壬','辛癸',
'壬甲','壬乙','壬丙','壬丁','壬戊','壬己','壬庚','壬辛','壬壬','壬癸',
'癸甲','癸乙','癸丙','癸丁','癸戊','癸己','癸庚','癸辛','癸壬','癸癸')

shishen_2to1_100=(  #定义2对于1的关系名称
'比肩','劫财','食神','伤官','偏财','正财','七杀','正官','枭神','正印',
'劫财','比肩','伤官','食神','正财','偏财','正官','七杀','正印','枭神',
'枭神','正印','比肩','劫财','食神','伤官','偏财','正财','七杀','正官',
'正印','枭神','劫财','比肩','伤官','食神','正财','偏财','正官','七杀', 
'七杀','正官','枭神','正印','比肩','劫财','食神','伤官','偏财','正财',
'正官','七杀','正印','枭神','劫财','比肩','伤官','食神','正财','偏财',
'偏财','正财','七杀','正官','枭神','正印','比肩','劫财','食神','伤官',
'正财','偏财','正官','七杀','正印','枭神','劫财','比肩','伤官','食神',
'食神','伤官','偏财','正财','七杀','正官','枭神','正印','比肩','劫财', 
'伤官','食神','正财','偏财','正官','七杀','正印','枭神','劫财','比肩', 

)

shishen_1to2_100=(  #定义关系为1对于2的关系名称
'比肩','劫财','枭神','正印','七杀','正官','偏财','正财','食神','伤官',
'劫财','比肩','正印','枭神','正官','七杀','正财','偏财','伤官','食神',
'食神','伤官','比肩','劫财','枭神','正印','七杀','正官','偏财','正财',
'伤官','食神','劫财','比肩','正印','枭神','正官','七杀','正财','偏财',
'偏财','正财','食神','伤官','比肩','劫财','枭神','正印','七杀','正官',
'正财','偏财','伤官','食神','劫财','比肩','正印','枭神','正官','七杀',
'七杀','正官','偏财','正财','食神','伤官','比肩','劫财','枭神','正印',
'正官','七杀','正财','偏财','伤官','食神','劫财','比肩','正印','枭神',
'枭神','正印','七杀','正官','偏财','正财','食神','伤官','比肩','劫财',
'正印','枭神','正官','七杀','正财','偏财','伤官','食神','劫财','比肩'   
)
ten_deities = {  #2to1 
    '甲':bidict({'甲':'比肩', "乙":'劫财', "丙":'食神', "丁":'伤官', "戊":'偏财',
                  "己":'正财', "庚":'七杀', "辛":'正官', "壬":'枭神', "癸":'正印', "子":'沐', 
                  "丑":'冠', "寅":'建', "卯":'帝', "辰":'衰', "巳":'病', "午":'死', 
                  "未":'墓', "申":'绝', "酉":'胎', "戌":'养', "亥":'长', '库':'未_', 
                  '本':'木', '克':'土', '被克':'金', '生我':'水', '生':'火','合':'己','冲':'庚'}),
    '乙':bidict({'甲':'劫财', "乙":'比肩', "丙":'伤官', "丁":'食神', "戊":'正财',
                  "己":'偏财', "庚":'正官', "辛":'七杀', "壬":'正印',"癸":'枭神', "子":'病', 
                  "丑":'衰', "寅":'帝', "卯":'建', "辰":'冠', "巳":'沐', "午":'长',
                  "未":'养', "申":'胎', "酉":'绝', "戌":'墓', "亥":'死', '库':'未_',
                  '本':'木', '克':'土', '被克':'金', '生我':'水', '生':'火','合':'庚','冲':'辛'}),
    '丙':bidict({'丙':'比肩', "丁":'劫财', "戊":'食神', "己":'伤官', "庚":'偏财',
                  "辛":'正财', "壬":'七杀', "癸":'正官', "甲":'枭神', "乙":'正印',"子":'胎', 
                  "丑":'养', "寅":'长', "卯":'沐', "辰":'冠', "巳":'建', "午":'帝',
                  "未":'衰', "申":'病', "酉":'死', "戌":'墓', "亥":'绝', '库':'戌_',
                  '本':'火', '克':'金', '被克':'水', '生我':'木', '生':'土','合':'辛','冲':'壬'}),
    '丁':bidict({'丙':'劫财', "丁":'比肩', "戊":'伤官', "己":'食神', "庚":'正财',
                  "辛":'偏财', "壬":'正官', "癸":'七杀', "甲":'正印',"乙":'枭神', "子":'绝', 
                  "丑":'墓', "寅":'死', "卯":'病', "辰":'衰', "巳":'帝', "午":'建',
                  "未":'冠', "申":'沐', "酉":'长', "戌":'养', "亥":'胎', '库':'戌_',
                  '本':'火', '克':'金', '被克':'水', '生我':'木', '生':'土','合':'壬','冲':'癸'}),
    '戊':bidict({'戊':'比肩', "己":'劫财', "庚":'食神', "辛":'伤官', "壬":'偏财',
                  "癸":'正财', "甲":'七杀', "乙":'正官', "丙":'枭神', "丁":'正印',"子":'胎', 
                  "丑":'养', "寅":'长', "卯":'沐', "辰":'冠', "巳":'建', "午":'帝',
                  "未":'衰', "申":'病', "酉":'死', "戌":'墓', "亥":'绝', '库':'辰_',
                  '本':'土', '克':'水', '被克':'木', '生我':'火', '生':'金','合':'癸','冲':''}),
    '己':bidict({'戊':'劫财', "己":'比肩', "庚":'伤官', "辛":'食神', "壬":'正财',
                  "癸":'偏财', "甲":'正官', "乙":'七杀', "丙":'正印',"丁":'枭神',"子":'绝', 
                  "丑":'墓', "寅":'死', "卯":'病', "辰":'衰', "巳":'帝', "午":'建',
                  "未":'冠', "申":'沐', "酉":'长', "戌":'养', "亥":'胎', '库':'辰_',
                  '本':'土', '克':'水', '被克':'木', '生我':'火', '生':'金','合':'甲','冲':''}),
    '庚':bidict({'庚':'比肩', "辛":'劫财', "壬":'食神', "癸":'伤官', "甲":'偏财',
                  "乙":'正财', "丙":'七杀', "丁":'正官', "戊":'枭神', "己":'正印',"子":'死', 
                  "丑":'墓', "寅":'绝', "卯":'胎', "辰":'养', "巳":'长', "午":'沐',
                  "未":'冠', "申":'建', "酉":'帝', "戌":'衰', "亥":'病', '库':'丑_',
                  '本':'金', '克':'木', '被克':'火', '生我':'土', '生':'水','合':'乙','冲':'甲'}), 
    '辛':bidict({'庚':'劫财', "辛":'比肩', "壬":'伤官', "癸":'食神', "甲":'正财',
                  "乙":'偏财', "丙":'正官', "丁":'七杀', "戊":'正印', "己":'枭神', "子":'长', 
                  "丑":'养', "寅":'胎', "卯":'绝', "辰":'墓', "巳":'死', "午":'病',
                  "未":'衰', "申":'帝', "酉":'建', "戌":'冠', "亥":'沐', '库':'丑_',
                  '本':'金', '克':'木', '被克':'火', '生我':'土', '生':'水','合':'丙','冲':'乙'}),
    '壬':bidict({'壬':'比肩', "癸":'劫财', "甲":'食神', "乙":'伤官', "丙":'偏财',
                  "丁":'正财', "戊":'七杀', "己":'正官', "庚":'枭神', "辛":'正印',"子":'帝', 
                  "丑":'衰', "寅":'病', "卯":'死', "辰":'墓', "巳":'绝', "午":'胎',
                  "未":'养', "申":'长', "酉":'沐', "戌":'冠', "亥":'建', '库':'辰_',
                  '本':'水', '克':'火', '被克':'土', '生我':'金', '生':'木','合':'丁','冲':'丙'}),
    '癸':bidict({'壬':'劫财', "癸":'比肩', "甲":'伤官', "乙":'食神', "丙":'正财',
                  "丁":'偏财', "戊":'正官', "己":'七杀', "庚":'正印',"辛":'枭神', "子":'建', 
                  "丑":'冠', "寅":'沐', "卯":'长', "辰":'养', "巳":'胎', "午":'绝',
                  "未":'墓', "申":'死', "酉":'病', "戌":'衰', "亥":'帝', '库':'辰_',
                  '本':'水', '克':'火', '被克':'土', '生我':'金', '生':'木','合':'戊','冲':'丁'}), 
}


ten_1to2_deities = {
    '甲':bidict({'甲':'比肩', "乙":'劫财', "丙":'枭神', "丁":'正印', "戊":'七杀',
                  "己":'正官', "庚":'偏财', "辛":'正财', "壬":'食神', "癸":'伤官', "子":'沐', 
                  "丑":'冠', "寅":'建', "卯":'帝', "辰":'衰', "巳":'病', "午":'死', 
                  "未":'墓', "申":'绝', "酉":'胎', "戌":'养', "亥":'长', '库':'未_', 
                  '本':'木', '克':'土', '被克':'金', '生我':'水', '生':'火','合':'己','冲':'庚'}),
    '乙':bidict({'甲':'劫财',"乙":'比肩', "丙":'正印',"丁":'枭神',"戊":'正官',
                  "己":'七杀', "庚":'正财', "辛":'偏财', "壬":'伤官',"癸":'食神', "子":'病', 
                  "丑":'衰', "寅":'帝', "卯":'建', "辰":'冠', "巳":'沐', "午":'长',
                  "未":'养', "申":'胎', "酉":'绝', "戌":'墓', "亥":'死', '库':'未_',
                  '本':'木', '克':'土', '被克':'金', '生我':'水', '生':'火','合':'庚','冲':'辛'}),
    '丙':bidict({'甲':'食神',"乙":'伤官', "丙":'比肩',"丁":'劫财',"戊":'枭神',
                  "己":'正印', "庚":'七杀', "辛":'正官',"壬":'偏财',"癸":'正财',"子":'胎', 
                  "丑":'养', "寅":'长', "卯":'沐', "辰":'冠', "巳":'建', "午":'帝',
                  "未":'衰', "申":'病', "酉":'死', "戌":'墓', "亥":'绝', '库':'戌_',
                  '本':'火', '克':'金', '被克':'水', '生我':'木', '生':'土','合':'辛','冲':'壬'}),
    '丁':bidict({'甲':'伤官',"乙":'食神', "丙":'劫财',"丁":'比肩',"戊":'正印', 
                  "己":'枭神', "庚":'正官', "辛":'七杀',"壬":'正财',"癸":'偏财', "子":'绝', 
                  "丑":'墓', "寅":'死', "卯":'病', "辰":'衰', "巳":'帝', "午":'建',
                  "未":'冠', "申":'沐', "酉":'长', "戌":'养', "亥":'胎', '库':'戌_',
                  '本':'火', '克':'金', '被克':'水', '生我':'木', '生':'土','合':'壬','冲':'癸'}),
    '戊':bidict({'甲':'偏财',"乙":'正财', "丙":'食神',"丁":'伤官',"戊":'比肩', 
                  "己":'劫财', "庚":'枭神', "辛":'正印',"壬":'七杀',"癸":'正官',"子":'胎', 
                  "丑":'养', "寅":'长', "卯":'沐', "辰":'冠', "巳":'建', "午":'帝',
                  "未":'衰', "申":'病', "酉":'死', "戌":'墓', "亥":'绝', '库':'辰_',
                  '本':'土', '克':'水', '被克':'木', '生我':'火', '生':'金','合':'癸','冲':''}),
    '己':bidict({'甲':'正财',"乙":'偏财', "丙":'伤官',"丁":'食神',"戊":'劫财', 
                  "己":'比肩', "庚":'正印', "辛":'枭神',"壬":'正官',"癸":'七杀',"子":'绝', 
                  "丑":'墓', "寅":'死', "卯":'病', "辰":'衰', "巳":'帝', "午":'建',
                  "未":'冠', "申":'沐', "酉":'长', "戌":'养', "亥":'胎', '库':'辰_',
                  '本':'土', '克':'水', '被克':'木', '生我':'火', '生':'金','合':'甲','冲':''}),
    '庚':bidict({'甲':'七杀',"乙":'正官', "丙":'偏财',"丁":'正财',"戊":'食神',
                  "己":'伤官', "庚":'比肩', "辛":'劫财',"壬":'枭神',"癸":'正印',"子":'死', 
                  "丑":'墓', "寅":'绝', "卯":'胎', "辰":'养', "巳":'长', "午":'沐',
                  "未":'冠', "申":'建', "酉":'帝', "戌":'衰', "亥":'病', '库':'丑_',
                  '本':'金', '克':'木', '被克':'火', '生我':'土', '生':'水','合':'乙','冲':'甲'}), 
    '辛':bidict({'甲':'正官',"乙":'七杀', "丙":'正财',"丁":'偏财',"戊":'伤官',
                   "己":'食神', "庚":'劫财', "辛":'比肩',"壬":'正印',"癸":'枭神',"子":'长', 
                  "丑":'养', "寅":'胎', "卯":'绝', "辰":'墓', "巳":'死', "午":'病',
                  "未":'衰', "申":'帝', "酉":'建', "戌":'冠', "亥":'沐', '库':'丑_',
                  '本':'金', '克':'木', '被克':'火', '生我':'土', '生':'水','合':'丙','冲':'乙'}),
    '壬':bidict({'甲':'枭神',"乙":'正印', "丙":'七杀',"丁":'正官',"戊":'偏财',
                  "己":'正财', "庚":'食神', "辛":'伤官',"壬":'比肩',"癸":'劫财',"子":'帝', 
                  "丑":'衰', "寅":'病', "卯":'死', "辰":'墓', "巳":'绝', "午":'胎',
                  "未":'养', "申":'长', "酉":'沐', "戌":'冠', "亥":'建', '库':'辰_',
                  '本':'水', '克':'火', '被克':'土', '生我':'金', '生':'木','合':'丁','冲':'丙'}),
    '癸':bidict({'甲':'正印',"乙":'枭神', "丙":'正官',"丁":'七杀',"戊":'正财',
                  "己":'偏财', "庚":'伤官', "辛":'食神',"壬":'劫财',"癸":'比肩', "子":'建', 
                  "丑":'冠', "寅":'沐', "卯":'长', "辰":'养', "巳":'胎', "午":'绝',
                  "未":'墓', "申":'死', "酉":'病', "戌":'衰', "亥":'帝', '库':'辰_',
                  '本':'水', '克':'火', '被克':'土', '生我':'金', '生':'木','合':'戊','冲':'丁'}), 
}


shishen=('劫财','比肩','伤官','食神','正财','偏财','正官','七杀','正印','枭神')
#shishen2=('比肩','劫财','食神','伤官','偏财','正财','七杀''正官','枭神''正印')

shishen2tg=('甲','乙','丙','丁','戊','己','庚','辛','壬','癸')  #对应shishen()的固定假设，不严谨。弃之

#ten_deities=ten_1to2_deities  ## 测试反向关系。。。或者是另一种关系。。。   ###验证，反向关系是一样的运算结果

#比肩
for i in range(0,10):
    for j in range(0,10):
            print(tiangan[i]+"-"+tiangan[j]+"->"+shishen_2to1_100[i*10+j]+" ",end="")
print()

while True :
    msg = input ( "\n------------------十神关系验证程序-----------------------------\n\
         >>>>根据以下输入情况进入不同功能<<<<\n\
q: 1个英文字母 ====》退出\n\
2个汉字: 1字天干+1字天干(如:甲丙) ====》两个天干十神关系（前者为主体）\n\
5个汉字: 1字天干+2字十神+2字十神(如:甲正财七杀) ====》两个十神关系运算结果\n\
7个汉字: 1字天干+2字十神+2字十神+2字十神(如:丙劫财正印伤官) (十神为：'比肩','劫财','枭神','正印','七杀','正官','偏财','正财','食神','伤官') ====》A+(B+C)和(A+B)+C两种结合运算结果\n\
请输入:") .replace ( " ", "" ). lower ()
    if msg == "q":
        break
    try:
        if len(msg)==2: #汉字两个，字母也是两个
            print("\n十神关系为："+shishen_2to1_100[tiangan_100.index(msg)])
            
            #idx_shishen=shishen.index(shishen_2to1_100[tiangan_100.index(msg)])
            #shishen_relation_to_tiangan=shishen2tg[idx_shishen]  #假设
            #print("十神属性对应的天干为："+shishen_relation_to_tiangan)
        elif  len(msg)==3: 
            #again calculate
            #正官的正官是什么？
            #五次相同运算转为自己，这个做为一个规则。
            #两个元素的十神规则下形成十神（对应某五行元素）。固定了。颠倒后形成
            #复合作用后，三次复合作用。形成的是相同的***
            msg_3_21=msg[0:2]
            #shishen_tmp=shishen_1to2_100[tiangan_100.index(msg_3)] #得到2个天干对应十神的名称
            tiangan_shishen_attribute=shishen2tg[shishen.index(shishen_1to2_100[tiangan_100.index(msg_3_21)])] #得到2个天干对应的十神属性对应的天干。
            tiangan_21=tiangan_shishen_attribute+msg[2:3]
            tiangan_3_21=shishen2tg[shishen.index(shishen_1to2_100[tiangan_100.index(tiangan_21)])] #得到2个天干对应的十神属性对应的天干。
            print("3个天干经由十神属性得到一个天干，21运算结合顺序得到天干为："+tiangan_3_21)
            msg_3_12=msg[1:3]
            #shishen_tmp=shishen_1to2_100[tiangan_100.index(msg_3)] #得到2个天干对应十神的名称
            tiangan_shishen_attribute=shishen2tg[shishen.index(shishen_1to2_100[tiangan_100.index(msg_3_12)])] #得到2个天干对应的十神属性对应的天干。
            tiangan_12=msg[0:1]+tiangan_shishen_attribute
            tiangan_3_12=shishen2tg[shishen.index(shishen_1to2_100[tiangan_100.index(tiangan_12)])] #得到2个天干对应的十神属性对应的天干。
            print("3个天干经由十神属性得到一个天十，12运算结合顺序得到天干为："+tiangan_3_12)
        elif  len(msg)==5:
            tg=msg[0:1]
            lista=ten_deities[msg[0:1]]
            tgss1=lista.inverse[msg[1:3]] #天干
            tgss2=lista.inverse[msg[3:5]]
            ss11=ten_deities[tgss1][tgss2] #十神关系
            gettg=ten_deities[tg].inverse[ss11]
                       
            print(f"\n^_^ --> 以上输入关系A.B运算结果: {tg} 根据十神关系得到天干为： {gettg} 得到的关系为： {ss11} ") 
        elif len(msg)==7: 
            gettg1=""
            gettg2=""
            lista=ten_deities[msg[0:1]]
            tg=msg[0:1]
            tgss1=lista.inverse[msg[1:3]] #天干
            tgss2=lista.inverse[msg[3:5]]
            tgss3=lista.inverse[msg[5:7]]
            
            #First cal order，后面的需要反向寻找
            ss11=ten_deities[tgss1][tgss2] #十神关系
            for i in ('甲','乙','丙','丁','戊','己','庚','辛','壬','癸') : #找出ss11十神关系，对应天干为tgss3的天干，如ss11为偏官，tgss3为乙，则结果为（辛）。
                listrow=ten_deities[i]
                if listrow[tgss3]==ss11: #
                   gettg1=listrow.inverse[ss11]
                   gettg1=i                          

            #Second cal order
            ss22=ten_deities[tgss2][tgss3] #后两个十神关系
            gettg2=ten_deities[tgss1].inverse[ss22]
            
            totalss=ten_deities[tg][gettg2]
               
            
            print(f"\n^_^ --> 关系A.B.C,(A+B)+C与A+(B+C)两种运算方式结果：{tg} 根据十神关系对应天干分别： {gettg1} 和 {gettg2} ，总的关系都是 {totalss} 。结论：关系运算结合律成立！")      
            print("\n****关系颠倒,关系运算能获得一样的关系输出，这是基于五行关系的。是一种典型的关系运算****")
            
            #丙劫财正印 =》枭神
            #丁劫财正印 
            #戊劫财正印 
            #####以上结论：关系运算与前面的天干。无关。
            #丁正印劫财 =》食神  
            #####以上结论：交换顺序，得到以比肩关系为e的互逆的结果
            #戊正印正官 =》枭神
            #戊正官正印 =》食神
            #戊正印七杀 =》正印
            
            #戊正印正印 =》比肩
            #戊正印枭神 =》劫财        
            #戊正印劫财 =》食神
            
            #戊正印比肩 =》伤官
            #戊正印伤官 =》偏财
            #戊正印食神 =》正财
            #戊正印正财 =》七杀
            #戊正印偏财 =》正官
            #戊正印正官 =》枭神 
            #戊正印七杀 =》正印  
            
            #戊枭神正印 =》劫财
            #戊枭神枭神 =》比肩 
            #戊枭神劫财 =》伤官 
            #戊枭神比肩 =》食神 
            
            #戊正官正印 =》食神
            #戊正官枭神 =》伤官 
            #戊正官劫财 =》偏财
            
            #戊正官比肩 =》正财
            #戊正官伤官 =》七杀
            #戊正官食神 =》正官
            
            #戊正财正印 =》偏财
            #戊正财比肩 =》正官
            #戊正财伤官 =》枭神        

            #戊伤官比肩 =》正印
            #戊伤官正官 =》偏财
            
            #丁伤官比肩 =》正印  #不影响
            ############## +比肩作用#######
            #戊劫财比肩 =》劫财    # 同一性，对称
            #戊伤官比肩 =》正印    # 同一性，对称
            #戊食神比肩 =》枭神    #对称
        
            #戊偏财比肩 =》七杀
                 
            #戊正官比肩 =》正财   #对称
            
            #戊正印比肩 =》伤官   #印枭 是后一位。
            #戊枭神比肩 =》食神
            ################比肩+关系A=关系A+++++
            #戊比肩正官 =》正官  #单位元。左单位元，也必然是右单位元
            
            ################ 劫财+ 作用 ，具有同一五行的相反作用。+++++
            #戊劫财正官 =》七杀
            #戊劫财七杀 =》正官
            #戊劫财正印 =》枭神
            #戊劫财偏财 =》正财   
            
            ################ +劫财 作用 ，反向但是对称=========
            #戊七杀劫财 =》正财 #对称反向   比肩是对称 
            #戊正印劫财 =》食神 #对称反向， 比肩是对称
            #是一个循环群吗
            #实现了反向，体现了阴阳变化的效果。   
            # 
            # 各种关系对 元素作用， 实现了元素的效果。。。 效果是怎样的。。如何匹配。。
            
            #所以
            ###########印+  生成关系为 伤食
            #戊正印伤官-偏财
            #戊正印比肩-伤官
            
            ############伤官+ ，使关系产生了自己的 正印，与自己属性相反的  
            #戊伤官正印 -七杀
            #戊伤官偏财 -伤官
            #戊伤官正官 -偏财 
            #戊伤官比肩 -正印
            #戊伤官劫财 -偏印
            
            ############财+ 使关系产生了自己的 官
            #戊正财正印 =》偏财
            #戊正财比肩 =》正官  
            #戊正财伤官 =》枭神   
            
            ############官+ 使关系产生了自己的 财
            #戊正官正印 =》食神
            #戊正官比肩 =》正财
            #戊正官伤官 =》七杀
            
            ###########比劫：自己   伤食：印， 财：官， 官：财， 印：伤食
            
            #印和伤食互生，  官和财互生。
            
            
            #甲伤官正印
            
            #前一个关系，到自己为比肩，所以复合后的关系为：如果后一个关系到前一个关系的距离为n，那么，复合关系为后一个关系向前n或是向后（10-n）步的关系。
            #如伤官比肩 ==》向后3，计-3，则比肩向后1为,正印
            #比肩为0，劫财为1，'食神'2,'伤官'3,'偏财'4,'正财'5,'七杀'6,'正官'7,'枭神'8,'正印'9
            #比肩为1，劫财为2，'食神'3,'伤官'4,'偏财'5,'正财'6,'七杀'7,'正官'8,'枭神'9,'正印'10
            
            #劫财为1，比肩为2，'伤官'3,'食神'4,'正财'5,'偏财'6,'正官'7,'七杀'8,'正印'9,'枭神'10,
            #劫财为1，比肩为1，'伤官'2,'食神'2,'正财'3,'偏财'3,'正官'4,'七杀'4,'正印'5,'枭神'5,    #同一类
            #'正财'2,'偏财'2,'伤官'1,'食神'1, 劫财为0，比肩为0，'正印'-1,'枭神'-1'正官'-2,'七杀'-2,   #体现了对比肩作用时的，反向的功能。
            #也是重要性体现
            
            #*********根据自己与比肩的关系A，得到自己作用于其它关系时，使“其它关系”产生同样关系A的关系。
            
             
            #              
            #####以上结论：1、正神偏神作用，得正神，正正或是偏偏作用，得到偏神，2、根据前一个关系与比肩关系的距离n，得到结果为第二个关系向后移动n，
            #各位同学，我用数学推导了一下，得到的结论是：   比劫作用其它关系：自己生自己   伤食作用其它关系：印， 财作用其它关系：官， 官作用其它关系：财， 印作用其它关系：伤食
            #结论是：印和伤食互生，官和财互生。 阴阳属性相同的得偏神、阴阳属性相异的神得正神。
            #是否可以认为：印食能生成一个相互能量团，财官能生成一个相互能量团，相互干扰。证明深层次的一些关系。
            #规则就是前面与后面的作用关系，将两个元素作用关系颠倒（如甲丁关系 为伤官或正印），生成的总的关系也是颠倒的。是等价的。
            
            #十神关系的关系，不同作用，出现了伤财官印比。。。。都是相生关系。但是产生了相应的聚集效应，而不是平均关系。
            #印食互生，财官互生。这是更高层次的关系。而没有出现。。。
            
            #子群：
            # #官印相生的八字稳重、孝顺、顾家、富贵
            
            ####逆关系为：正财<->正财，偏财<->偏财，劫财<->劫财，伤官<->伤官，劫财<->劫财。	如(甲)为主体，则伤官为(丁)，根据(丁)，找到某一种(关系)，使产生(甲)。则关系为正印。所以	伤官+正印=比肩。
            #和自己形成一个逆关系
            #任意一个都是关系，无穷的子群。
            
            ####多种运算关系，会得到不同的关系。。。比如逆关系为:如后者对前者的作用。。。。
            #这种不经意的变换，产生了不同的效果。。。
            
            #戊劫财正印 =》枭神   --劫财的 印
            #戊伤官正印 =》七杀   --伤官的 财
            #戊正财正印 =》偏财   --正财的 劫
            #戊正官正印 =》食神   --正官的 官
            #戊正印正印 =》比肩   --正印的 伤   

        ###缺一个自己的财####
            #戊劫财比肩 =》劫财   --劫财的 比肩
            #戊伤官比肩 =》正印   --伤官的 官
            #戊正财比肩 =》正官   --正财的 伤
            #戊正官比肩 =》正财   --正官的 印
            #戊正印比肩 =》伤官   --正印的 财   
           
            
         ###### 5阶必然为一个循环群，（当时想：因为比肩为偏，所以其它也为偏）     比肩枭神食神偏财七杀
         #戊枭神食神--偏财
         #戊枭神偏财--七杀
         #戊枭神七杀--枭神
         #戊枭神比肩--食神
         #戊枭神食神--偏财
         ###****5阶****，必然是一个循环群。。。
         ##单位元，即是 （1，2，3，4，5） 平方=（1，3，5，2，4）
         #上面是偏偏为偏
         
         ######2阶群：比肩+任一关系
         
         
         ######正正则为偏，出现偏神。。。不能构成5阶循环群
         #戊伤官正财-- 食神
         #戊伤官正官--七杀
         #戊伤官正印--枭神
         #戊伤官比劫--食神
         
        '''
        关系就是，各种映射，相互之间的关系。
        关系的关系是什么
        
         
         
        '''
        
      
    except:
         print('输入有误，请重新输入。。。')

